In [2]:
import sqlite3

In [3]:
con=sqlite3.connect('students.db')

In [4]:
cur=con.cursor()

In [5]:
CREATE_TABLE_QUERY="""
create table student(
id int primary key,
name varchar not null,
address varchar not null,
college varchar not null,
age int not null,
gender varchar(1) not null,
faculty varchar not null

);
"""
cur.execute(CREATE_TABLE_QUERY)

OperationalError: table student already exists

In [6]:
INSERT_RECORDS="""
insert into student 
('id','name','address','college','age','gender','faculty')
values
(1,'ram','kathmandu','ncit',18,'m','IT'),
(2,'shyam','lalitpur','islington',20,'m','CSIT'),
(3,'gita','pokhara','ncit',21,'f','SE'),
(4,'sita','kathmandu','ioe pulchowk',24,'f','ce');
"""
cur.execute(INSERT_RECORDS)

IntegrityError: UNIQUE constraint failed: student.id

In [7]:
con.commit()

In [8]:
all_student=cur.execute("SELECT*FROM student;")
for student in all_student:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'TU', '9846448426', 'ram@gmail.com')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU', '9846448426', 'shyam@gmail.com')
(3, 'gita', 'lalitpur', 'ncit', 21, 'f', 'SE', 'TU', '98464788426', 'gita@gmail.com')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'ce', 'TU', '98464788426', 'sita@gmail.com')
(5, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU', '9846448426', 'hari@gmail.com')
(6, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'UK', 'BIT', '9846448926', 'madan@gmail.com')
(7, 'maya devi', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU', '9846448726', 'maya@gmail.com')

In [12]:
all_student=cur.execute("SELECT name, address FROM student;")
for student in all_student:
    print(student)

('ram', 'kathmandu')
('shyam', 'lalitpur')
('gita', 'pokhara')
('sita', 'kathmandu')

In [13]:
cur.execute("UPDATE student set address='lalitpur' WHERE id=3;")

In [14]:
all_student=cur.execute("SELECT*FROM student;")
for student in all_student:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')
(3, 'gita', 'lalitpur', 'ncit', 21, 'f', 'SE')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'ce')

In [15]:
cur.execute("ALTER table student add university default 'TU';")
cur.execute("ALTER table student add contact varchar(20);")
cur.execute("ALTER table student add email varchar(20);")

In [16]:
cur.execute("""
UPDATE student set contact='9846448426', email ='ram@gmail.com' 
WHERE id=1;
""")

In [17]:
cur.execute("""
UPDATE student set contact='9846449626', email ='shyam@gmail.com' 
WHERE id=2;
""")

In [18]:
cur.execute("""
UPDATE student set contact='98464788426', email ='gita@gmail.com' 
WHERE id=3;
""")

In [19]:
cur.execute("""
UPDATE student set contact='98464788526', email ='sita@gmail.com' 
WHERE id=4;
""")

In [20]:
all_student=cur.execute("SELECT*FROM student;")
for student in all_student:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'TU', '9846448426', 'ram@gmail.com')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU', '9846448426', 'shyam@gmail.com')
(3, 'gita', 'lalitpur', 'ncit', 21, 'f', 'SE', 'TU', '98464788426', 'gita@gmail.com')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'ce', 'TU', '98464788426', 'sita@gmail.com')

In [22]:
address=input("Enter the address:")

all_student=cur.execute(f"SELECT*FROM student \
where address='{address}';")
for student in all_student:
    print(student)

Enter the address:kathmandu
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'TU', '9846448426', 'ram@gmail.com')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'ce', 'TU', '98464788426', 'sita@gmail.com')

In [26]:
address=input("Enter the address:")

all_student=cur.execute(f"SELECT*FROM student \
where address='{address}';")
for student in all_student:
    print(student)

Enter the address:lalitpur' or address= 'kathmandu ​
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU', '9846448426', 'shyam@gmail.com')
(3, 'gita', 'lalitpur', 'ncit', 21, 'f', 'SE', 'TU', '98464788426', 'gita@gmail.com')

In [ ]:
#SELECT*FROM student where address='{address='lalitpur' or address= 'kathmandu}';"

In [30]:
address=input("Enter the address:")

all_student=cur.execute(f"SELECT*FROM student \
where address=?;",(address,))
for student in all_student:
    print(student)

Enter the address:lalitpur' or address= 'kathmandu ​

In [41]:
students=[
(5,'hari bahadur','lalitpur','ncit',23,'m','SE','PU','9846448426','hari@gmail.com'),
(6,'madan bahadur','kathmandu','british college',24,'m','UK','BIT','9846448926','madan@gmail.com'),
(7,'maya devi','lalitpur','ncit',23,'m','SE','PU','9846448726','maya@gmail.com')
]

In [ ]:
cur.executemany(st)

In [42]:
INSERT_STUDENT_QUERY ="""

insert into student 
('id','name','address','college','age','gender','faculty','university','contact','email')
values
(?,?,?,?,?,?,?,?,?,?);

"""
cur.executemany(INSERT_STUDENT_QUERY,students)

In [43]:
con.commit()

In [9]:
import sqlite3
con=sqlite3.connect('students.db')
cur=con.cursor()

In [10]:
student= (8,'Sandesh Chaulagain','Bhaktapur','WRC',23,'m','SE','TU','9846448426','Sandes.cgn@gmail.com')
    
INSERT_STUDENT_QUERY ="""

insert into student 
('id','name','address','college','age','gender','faculty','university','contact','email')
values
(?,?,?,?,?,?,?,?,?,?);

"""

cur.execute(INSERT_STUDENT_QUERY,student)

In [11]:
con.commit()